### **Pandas practice notebook**

![](https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Pandas_logo.svg/2880px-Pandas_logo.svg.png)

### **Pandas Overview**

In computer programming, pandas is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series. It is free software released under the three-clause BSD license. The name is derived from the term "panel data", an econometrics term for data sets that include observations over multiple time periods for the same individuals. Its name is a play on the phrase "Python data analysis" itself. Wes McKinney started building what would become pandas at AQR Capital while he was a researcher there from 2007 to 2010 ([Pandas in wikipedia](https://en.wikipedia.org/wiki/Pandas_(software))).

Fundamentally, the functionality of Pandas is built on top of NumPy and both libraries belong to the SciPy stack. This means that Pandas relies heavily on NumPy array to implement its objects for manipulation and computation — but used in a more convenient fashion.
In practice, NumPy & Pandas are still being used interchangeably. The high level features and its convenient usage are what determine my preference in Pandas.

#### Sources and Contents to review 
1. [Pandas documentation](https://pandas.pydata.org/pandas-docs/stable/index.html)
1. [Pandas tutorial by Joris Van den Bossche](https://github.com/jorisvandenbossche/pandas-tutorial)
1. [The Pandas DataFrame: Make Working With Data Delightful](https://realpython.com/pandas-dataframe/)
1. [Why and How to Use Pandas with Large Data](https://towardsdatascience.com/why-and-how-to-use-pandas-with-large-data-9594dda2ea4c#:~:text=Pandas%20has%20been%20one%20of,transforming%2C%20manipulating%20and%20analyzing%20data.)
1. [Community tutorials](https://pandas.pydata.org/pandas-docs/stable/getting_started/tutorials.html)
1. [A Quick Introduction to the “Pandas” Python Library](https://towardsdatascience.com/a-quick-introduction-to-the-pandas-python-library-f1b678f34673)
1. [Datacamp Pandas Cheat Sheet](https://www.datacamp.com/community/blog/python-pandas-cheat-sheet)
1. [Pandas Cheat Sheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)

### **Tutorial**
([source](https://realpython.com/pandas-dataframe/))

You can start working with DataFrames by importing Pandas:

In [1]:
import pandas as pd
import numpy as np

here are several ways to create a Pandas DataFrame. In most cases, you’ll use the DataFrame constructor and provide the data, labels, and other information. You can pass the data as a two-dimensional list, tuple, or NumPy array.

In [2]:
data = {
    'name': ['Xavier', 'Ann', 'Jana', 'Yi', 'Robin', 'Amal', 'Nori'],
    'city': ['Mexico City', 'Toronto', 'Prague', 'Shanghai',
             'Manchester', 'Cairo', 'Osaka'],
     'age': [41, 28, 33, 34, 38, 31, 37],
     'py-score': [88.0, 79.0, 81.0, 80.0, 68.0, 61.0, 84.0]}
row_labels = [101, 102, 103, 104, 105, 106, 107]

In [3]:
df = pd.DataFrame(data=data, index=row_labels)
df.head(n=2) # Get the first n rows
df.tail(n=2) # Get the last n rows

     name   city  age  py-score
106  Amal  Cairo   31      61.0
107  Nori  Osaka   37      84.0

In [4]:
cities = df['city'] # or use df.city
cities[101]

'Mexico City'

More examples of creting data frames from list and distionaries

In [5]:
data = {'x': [1, 2, 3], 'y': np.array([2, 4, 8]), 'z': 100}
pd.DataFrame(data)

   x  y    z
0  1  2  100
1  2  4  100
2  3  8  100

In [6]:
l = [{'x': 1, 'y': 2, 'z': 100},
     {'x': 2, 'y': 4, 'z': 100},
     {'x': 3, 'y': 8, 'z': 100}]
pd.DataFrame(l, columns=['x', 'y', 'z'])

   x  y    z
0  1  2  100
1  2  4  100
2  3  8  100

In [7]:
l = [[1, 2, 100],  
     [2, 4, 100],
     [3, 8, 100]]
pd.DataFrame(l, columns=['x', 'y', 'z'])

   x  y    z
0  1  2  100
1  2  4  100
2  3  8  100

In [8]:
 arr = np.array([[1, 2, 100],           
                 [2, 4, 100],
                 [3, 8, 100]])
pd.DataFrame(arr, columns=['x', 'y', 'z'])

   x  y    z
0  1  2  100
1  2  4  100
2  3  8  100

Although the last example looks almost the same as the nested list implementation above, it has one advantage: You can specify the optional parameter copy.

When copy is set to False (its default setting), the data from the NumPy array isn’t copied. This means that the original data from the array is assigned to the Pandas DataFrame. If you modify the array, then your DataFrame will change too:

In [9]:
df_1 = pd.DataFrame(arr, columns=['x', 'y', 'z'])
arr[0, 0] = 1000
df_1

      x  y    z
0  1000  2  100
1     2  4  100
2     3  8  100

#### **Creating a Pandas DataFrame From Files**
You can save and load the data and labels from a Pandas DataFrame to and from a number of file types, including CSV, Excel, SQL, JSON, and more. This is a very powerful feature.

You can save your job candidate DataFrame to a CSV file with .to_csv():

In [10]:
df_1.to_csv('data.csv')

You can read csv using `to_csv` method:

In [11]:
df_1 = pd.read_csv('data.csv', index_col=0)

Data Types
The types of the data values, also called data types or dtypes, are important because they determine the amount of memory your DataFrame uses, as well as its calculation speed and level of precision.

Pandas relies heavily on NumPy data types. However, Pandas 1.0 introduced some additional types:

* BooleanDtype and BooleanArray support missing Boolean values and Kleene three-value logic.

* StringDtype and StringArray represent a dedicated string type.

You can get the data types for each column of a Pandas DataFrame with .dtypes:

In [12]:
df.dtypes

name         object
city         object
age           int64
py-score    float64
dtype: object

In [13]:
df = df.astype(dtype={'age': np.int32, 'py-score': np.float32})
df.dtypes

name         object
city         object
age           int32
py-score    float32
dtype: object

#### Pandas DataFrame Size

The attributes .ndim, .size, and .shape return the number of dimensions, number of data values across each dimension, and total number of data values, respectively:

In [14]:
df.ndim

2

In [15]:
df.shape

(7, 4)

In [16]:
df.size

28

In [17]:
df.memory_usage()

Index       376
name         56
city         56
age          28
py-score     28
dtype: int64

#### **Getting Data With Accessors**

Pandas has four accessors in total:

* `.loc[]` accepts the labels of rows and columns and returns Series or DataFrames. You can use it to get entire rows or columns, as well as their parts.

* `.iloc[]` accepts the zero-based indices of rows and columns and returns Series or DataFrames. You can use it to get entire rows or columns, or their parts.

* `.at[]` accepts the labels of rows and columns and returns a single data value.

* `.iat[]` accepts the zero-based indices of rows and columns and returns a single data value.

In [18]:
df.loc[:, 'city']

101    Mexico City
102        Toronto
103         Prague
104       Shanghai
105     Manchester
106          Cairo
107          Osaka
Name: city, dtype: object

In [19]:
df.iloc[:, 1]

101    Mexico City
102        Toronto
103         Prague
104       Shanghai
105     Manchester
106          Cairo
107          Osaka
Name: city, dtype: object

In [20]:
df.loc[101:105, ['name', 'city']]

       name         city
101  Xavier  Mexico City
102     Ann      Toronto
103    Jana       Prague
104      Yi     Shanghai
105   Robin   Manchester

In [21]:
df.iloc[1:6, [0, 1]]

      name        city
102    Ann     Toronto
103   Jana      Prague
104     Yi    Shanghai
105  Robin  Manchester
106   Amal       Cairo

In [22]:
df.iloc[1:6:2, 0]

102     Ann
104      Yi
106    Amal
Name: name, dtype: object

In [23]:
df.iloc[np.arange(1,6,2), 0]

102     Ann
104      Yi
106    Amal
Name: name, dtype: object

In [24]:
df.at[102, 'name']

'Ann'

In [25]:
df.iat[1, 0]

'Ann'

#### **Setting Data With Accessors**

You can use accessors to modify parts of a Pandas DataFrame by passing a Python sequence, NumPy array, or single value:

In [26]:
df.loc[:104, 'py-score'] = [40, 50, 60, 70]
df.loc[105:, 'py-score'] = 0
df['py-score']

101    40.0
102    50.0
103    60.0
104    70.0
105     0.0
106     0.0
107     0.0
Name: py-score, dtype: float32

In [27]:
df.iloc[:, -1] = np.array([88.0, 79.0, 81.0, 80.0, 68.0, 61.0, 84.0])
df

       name         city  age  py-score
101  Xavier  Mexico City   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0

#### **Inserting and Deleting Data**

Pandas provides several convenient techniques for inserting and deleting rows or columns. You can choose among them based on your situation and needs.

In [28]:
 john = pd.Series(data=['John', 'Boston', 34, 79],
                  index=df.columns, name=108)
print(john)
df = df.append(john)
print(df)

name          John
city        Boston
age             34
py-score        79
Name: 108, dtype: object
       name         city  age  py-score
101  Xavier  Mexico City   41      88.0
102     Ann      Toronto   28      79.0
103    Jana       Prague   33      81.0
104      Yi     Shanghai   34      80.0
105   Robin   Manchester   38      68.0
106    Amal        Cairo   31      61.0
107    Nori        Osaka   37      84.0
108    John       Boston   34      79.0

In [29]:
df = df.drop(labels=[108])

In [30]:
df['js-score'] = np.array([71.0, 95.0, 88.0, 79.0, 91.0, 91.0, 80.0])
df

       name         city  age  py-score  js-score
101  Xavier  Mexico City   41      88.0      71.0
102     Ann      Toronto   28      79.0      95.0
103    Jana       Prague   33      81.0      88.0
104      Yi     Shanghai   34      80.0      79.0
105   Robin   Manchester   38      68.0      91.0
106    Amal        Cairo   31      61.0      91.0
107    Nori        Osaka   37      84.0      80.0

In [31]:
df['total-score'] = 0.0
df

       name         city  age  py-score  js-score  total-score
101  Xavier  Mexico City   41      88.0      71.0          0.0
102     Ann      Toronto   28      79.0      95.0          0.0
103    Jana       Prague   33      81.0      88.0          0.0
104      Yi     Shanghai   34      80.0      79.0          0.0
105   Robin   Manchester   38      68.0      91.0          0.0
106    Amal        Cairo   31      61.0      91.0          0.0
107    Nori        Osaka   37      84.0      80.0          0.0

In [32]:
df.insert(loc=4, column='django-score',
          value=np.array([86.0, 81.0, 78.0, 88.0, 74.0, 70.0, 81.0]))

You can delete one or more columns from a Pandas DataFrame just as you would with a regular Python dictionary, by using the del statement:

In [33]:
del df['total-score']
df

       name         city  age  py-score  django-score  js-score
101  Xavier  Mexico City   41      88.0          86.0      71.0
102     Ann      Toronto   28      79.0          81.0      95.0
103    Jana       Prague   33      81.0          78.0      88.0
104      Yi     Shanghai   34      80.0          88.0      79.0
105   Robin   Manchester   38      68.0          74.0      91.0
106    Amal        Cairo   31      61.0          70.0      91.0
107    Nori        Osaka   37      84.0          81.0      80.0

You can also remove one or more columns with .drop() as you did previously with the rows. Again, you need to specify the labels of the desired columns with labels. In addition, when you want to remove columns, you need to provide the argument axis=1:

In [34]:
df = df.drop(labels='age', axis=1)

#### **Applying Arithmetic Operations**
You can apply basic arithmetic operations such as addition, subtraction, multiplication, and division to Pandas Series and DataFrame objects the same way you would with NumPy arrays:

In [35]:
df['py-score'] + df['js-score']

101    159.0
102    174.0
103    169.0
104    159.0
105    159.0
106    152.0
107    164.0
dtype: float64

In [36]:
df['py-score'] / 100

101    0.88
102    0.79
103    0.81
104    0.80
105    0.68
106    0.61
107    0.84
Name: py-score, dtype: float64

In [37]:
df['total'] = 0.4 * df['py-score'] + 0.3 * df['django-score'] + 0.3 * df['js-score']

Most NumPy and SciPy routines can be applied to Pandas Series or DataFrame objects as arguments instead of as NumPy arrays. To illustrate this, you can calculate candidates’ total test scores using the NumPy routine numpy.average().

Instead of passing a NumPy array to numpy.average(), you’ll pass a part of your Pandas DataFrame:

In [44]:
np.average(df.loc)

Index(['name', 'city', 'py-score', 'django-score', 'js-score', 'total'], dtype='object')